const co = require("co");
let list = ["101|无线局域网测试仪",
    "102|LCR",
    "103|环境试验箱",
    "104|卡尺",
    "105|电压电流源",
    "106|电子秤",
    "107|电子天平",
    "108|光功率计",
    "109|光衰减器",
    "110|温湿度计",
    "111|数字多用表",
    "112|功率传感器",
    "113|人体综合测试仪",
    "114|塞规",
    "115|大理石平台",
    "116|推拉力计",
    "117|示波器",
    "118|眼图仪",
    "119|眼图仪模块",
    "120|张力计",
    "121|照度计",
    "122|表面静电压表",
    "123|表面电阻测试仪",
    "124|插拔力试验机",
    "125|插拔力试验机",
    "126|密度计",
    "127|二次元",
    "128|风速计",
    "129|辐射监测仪",
    "130|傅里叶红外光谱仪",
    "131|千分量具",
    "132|扭力类",
    "133|气密性测试仪",
    "134|APD灵敏度自动测试系统",
    "135|BOSA自动测试仪",
    "136|BTU轨道振动仪",
    "137|DIP tester",
    "138|E1综合测试仪",
    "139|ICT测试仪",
    "140|LD综合测试仪",
    "141|显微镜",
    "142|GPS测试仪",
    "143|RF信号测试仪器",
    "144|温度测试仪",
    "145|频率计",
    "146|1490光源",
    "147|3D端面测试仪",
    "148|安规测试仪",
    "149|百分尺",
    "150|变压器综合测试仪",
    "151|插损回损测试仪",
    "152|电容耐压漏电流测试仪",
    "153|电视场强频谱仪",
    "154|电视信号发生器",
    "155|电阻箱",
    "156|动态电阻表",
    "157|多功能摩擦试验机",
    "158|光谱分析仪",
    "159|光源",
    "160|含水率测试仪",
    "161|胶带剥离试验机",
    "162|接地电阻测试仪",
    "163|晶体管特性图示仪测试报告",
    "164|绝缘测试仪",
    "165|绝缘电阻表",
    "166|可编程直流电子负载",
    "167|离子风机测试仪",
    "168|尘埃粒子计数器",
    "169|面铜测厚仪",
    "170|耐压漏电容测试仪",
    "171|能量色散X荧光光谱仪",
    "172|频谱分析仪",
    "173|热成像仪",
    "174|熔体流动速率测定仪",
    "175|射频功率计",
    "176|射频网络分析仪",
    "177|深度规",
    "178|矢量网络分析仪",
    "179|瞬断测试仪（10通道）",
    "180|万能角度尺",
    "181|网络分析仪",
    "182|微孔材料硬度计",
    "183|无线综合测试仪",
    "184|误码分析仪",
    "185|西门子贴片机气压表",
    "186|锡膏厚度测试仪（SPI)",
    "187|线性交流电源供应器",
    "188|旋转粘度计",
    "189|盐雾试验箱",
    "190|震动机台",
    "191|直流低电阻测试仪",
    "192|纸箱抗压试验仪",
    "808|计量标准件",
];
let { InsCodeModel } = require("./repositories/mongoHelper.js");

function save(code, name) {
    var model = new InsCodeModel({
        code,
        name
    });

    return new Promise((rs, rj) => {
        model.save((err, res) => {
            if (err) {
                console.warn("save", type, "Error:", err);
                rj(err);
            } else {
            	console.log("save success")
                rs(res);
            }
        })
    });
}
co(function*() {
    for (let item of list) {
        yield save(item.split("|")[0], item.split("|")[1]);
    }
});
